app/views/messages/_message.html.erb

  <br><br>
  <strong><%= avatar_for(message.user,size:40) %>  <%= link_to message.user.firstname, "/user/#{message.user.username}" %></strong><span style = "font-size:10px; color:rgb(160,160,160)"> <%= message.created_at %></span><br>
---
INSERT INTO "messages" ("chatroom_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["chatroom_id", 1], ["user_id", 4], ["body", "klfkdm"], ["created_at", 2017-03-01 06:53:51 UTC], ["updated_at", 2017-03-01 06:53:51 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]