app/views/pins/index.html.erb


        <span style = "color:rgb(80,80,80); font-size: 14px; font-weight: bold;">Posts</span><i class="fa fa-clipboard" aria-hidden="true" style = "margin-left: 15px; color:#737495; font-size:17px;"></i><strong><span style = "font-size:17px; margin-left:4px;"><%= current_user.pins.count %></span></i></strong><br>
---
SELECT "pins".* FROM "pins" ORDER BY created_at DESC

            <% if pin.user.occupation == "Student" %>
                <%= link_to pin.user.firstname + " " + pin.user.lastname, "/user/#{pin.user.username}" , class:'user-link'%> <span style="float:right; margin-right: 30px; font-size:22px; font-weight:bold; color:#D79C8C;"><%= pin.user.occupation.upcase %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]