app/views/pins/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% if @pin.video_file? && @pin.document? && !@pin.image? %>
            <p style = "color:#17A697; font-weight:bold;"><%= @pin.user.firstname %> attached a PDF to this post!</p>