app/views/chatrooms/_side_nav.html.erb

SELECT "chatrooms".* FROM "chatrooms" INNER JOIN "chatroom_users" ON "chatrooms"."id" = "chatroom_users"."chatroom_id" WHERE "chatroom_users"."user_id" = ?  [["user_id", 1]]
---
            <br><br><br><br><br>
            <% current_user.chatrooms.each do |chatroom| %>