app/views/chatrooms/index.html.erb

SELECT "chatrooms".* FROM "chatrooms" INNER JOIN "chatroom_users" ON "chatrooms"."id" = "chatroom_users"."chatroom_id" WHERE "chatroom_users"."user_id" = ?  [["user_id", 1]]
---
          <ul>
            <% current_user.chatrooms.each do |chatroom| %>