app/views/videos/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <p class = "videos-owner">
        <%= video.user.firstname + " " + video.user.lastname %>