app/views/teachers/profile.html.erb

SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "classrooms" WHERE "classrooms"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "pins" WHERE "pins"."user_id" = ?  [["user_id", 1]]
---
    <i style = "color:#E94C6F; font-size:20px;" class="fa fa-eercast" aria-hidden="true"></i> <strong><span style = "font-size:20px;"><%= @user.achievements %></span></strong>
    <i style = "color: #E94C6F; font-size:20px;" class="fa fa-book" aria-hidden="true"></i><strong><span style = "font-size:20px;"><%= @user.classrooms.count %></span></strong>
    <i style = "color:#E94C6F; font-size:20px;" class="fa fa-clipboard" aria-hidden="true"></i><strong><span style = "font-size:20px;"><%= @user.pins.count %></span></strong>

SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = ?  [["user_id", 1]]
---
<br>
  <% if @user.videos.present? %>

SELECT "podcasts".* FROM "podcasts" WHERE "podcasts"."user_id" = ?  [["user_id", 1]]
---

  <% if @user.podcasts.present? %>

SELECT "meets".* FROM "meets" WHERE "meets"."user_id" = ?  [["user_id", 1]]
---

  <% if @user.meets.present? %>

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---

  <% if @user.articles.present? %>