app/views/meets/show.html.erb

    <p class ="text-center meet-description-label">Recent Meetups</p>
    <% @meet.user.meets.each do |meet| %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "meets".* FROM "meets" WHERE "meets"."user_id" = ?  [["user_id", 1]]