app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY "articles"."cached_votes_score" DESC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
---
  def index
    @articles = Article.all.order(:cached_votes_score => :desc)

INSERT INTO "articles" ("created_at", "updated_at", "title", "description", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @article = current_user.articles.build (article_params)

    if @article.save

UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
  def update
    respond_to do |format|
      if @article.update(article_params)