app/controllers/chatrooms_controller.rb

SELECT "chatrooms".* FROM "chatrooms"
---
  def index
    @search = Chatroom.search do

SELECT  "messages".* FROM "messages" WHERE "messages"."chatroom_id" = ? ORDER BY "messages"."created_at" DESC LIMIT ?  [["chatroom_id", 2], ["LIMIT", 100]]
---
  def show
    @messages = @chatroom.messages.order(created_at: :desc).limit(100).reverse

INSERT INTO "chatrooms" ("name", "created_at", "updated_at", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "lkmlkm"], ["created_at", 2017-04-28 00:08:10 UTC], ["updated_at", 2017-04-28 00:08:10 UTC], ["body", ""], ["user_id", 4]]
---
  def create
    @chatroom = Chatroom.new(chatroom_params)

    respond_to do |format|
      if @chatroom.save

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_chatroom
      @chatroom = Chatroom.find(params[:id])