app/controllers/chatroom_users_controller.rb

  def create
    @chatroom_user = @chatroom.chatroom_users.where(user_id: current_user.id).first_or_create
---
INSERT INTO "chatroom_users" ("chatroom_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["chatroom_id", 1], ["user_id", 1], ["created_at", 2017-02-28 23:21:44 UTC], ["updated_at", 2017-02-28 23:21:44 UTC]]
SELECT  "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ? ORDER BY "chatroom_users"."id" ASC LIMIT ?  [["chatroom_id", 1], ["user_id", 1], ["LIMIT", 1]]

  def destroy
    @chatroom_user = @chatroom.chatroom_users.where(user_id: current_user.id).destroy_all
---
DELETE FROM "chatroom_users" WHERE "chatroom_users"."id" = ?  [["id", 1]]
SELECT "chatroom_users".* FROM "chatroom_users" WHERE "chatroom_users"."chatroom_id" = ? AND "chatroom_users"."user_id" = ?  [["chatroom_id", 1], ["user_id", 1]]

    def set_chatroom
      @chatroom = Chatroom.find(params[:chatroom_id])
---
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]