app/controllers/comments_controller.rb

  def create
    @comment = @post.comments.create(params[:comment].permit(:content, :image, :mp3))
    @comment.user_id = current_user.id
    @comment.save
---
INSERT INTO "comments" ("content", "created_at", "updated_at", "video_id") VALUES (?, ?, ?, ?)  [["content", "Nice"], ["created_at", 2017-05-24 13:24:13 UTC], ["updated_at", 2017-05-24 13:24:13 UTC], ["video_id", 3]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", 2017-05-24 13:24:13 UTC], ["id", 1]]