app/controllers/events_controller.rb

  def create
    @event = current_user.events.build (event_params)
    @event.save
---
INSERT INTO "events" ("title", "start", "end", "color", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)