app/controllers/meets_controller.rb

  def create
    @meet = current_user.meets.build (meet_params)

    if @meet.save
---
INSERT INTO "meets" ("name", "description", "address1", "address2", "city", "state", "created_at", "updated_at", "latitude", "longitude", "user_id", "colorheader", "colorbackground", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @meet = Meet.find(params[:id])
---
SELECT  "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]