app/controllers/messages_controller.rb

INSERT INTO "messages" ("chatroom_id", "user_id", "body", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "video_file_file_name", "video_file_content_type", "video_file_file_size", "video_file_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    message = @chatroom.messages.new(message_params)
    message.user = current_user
    message.save

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_chatroom
      @chatroom = Chatroom.find(params[:chatroom_id])