app/controllers/pins_controller.rb

  def index
    search = params[:term].present? ? params[:term] : nil
    @pins = if search
              Pin.search(search)
---
SELECT "pins".* FROM "pins" ORDER BY created_at DESC

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "jjj"], ["updated_at", 2017-02-28 07:36:42 UTC], ["id", 1]]

  def create
    @pin = current_user.pins.build (pin_params)

    if @pin.save
---
INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "jcmljdmc"], ["description", "lkdsmcskldml"], ["created_at", 2017-02-28 08:20:52 UTC], ["updated_at", 2017-02-28 08:20:52 UTC], ["user_id", 2]]