app/controllers/podcasts_controller.rb

  def index
    @podcasts = Podcast.all
---
SELECT "podcasts".* FROM "podcasts"

  def create
    @podcast = current_user.podcasts.build (podcast_params)

    respond_to do |format|
      if @podcast.save
---
INSERT INTO "podcasts" ("title", "description", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @podcast.update(podcast_params)
---
UPDATE "podcasts" SET "mp3_file_name" = ?, "mp3_content_type" = ?, "mp3_file_size" = ?, "mp3_updated_at" = ?, "description" = ?, "updated_at" = ? WHERE "podcasts"."id" = ?

  def show
    impressionist(@podcast)
    @podcasts = Podcast.all.where('user_id = ?', @podcast.user.id).last
---
SELECT  "podcasts".* FROM "podcasts" WHERE (user_id = 1) ORDER BY "podcasts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_podcast
      @podcast = Podcast.find(params[:id])
---
SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]