app/controllers/teachers_controller.rb

  def profile
    @teacher = current_user

    if User.find_by_username(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jalen201"], ["LIMIT", 1]]

  def calendar
    @teacher = current_user

    if User.find_by_username(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jalen201"], ["LIMIT", 1]]