app/controllers/videos_controller.rb

  def index
    @videos = Video.all.order(:cached_votes_score => :desc)
---
SELECT "videos".* FROM "videos" ORDER BY "videos"."cached_votes_score" DESC

  def show
    impressionist(@video)
    @videos = Video.all
    @comments = Comment.where(video_id: @video).order('created_at DESC')
---
SELECT "videos".* FROM "videos"
SELECT "comments".* FROM "comments" WHERE "comments"."video_id" = 2 ORDER BY created_at DESC

  def create
    @video = current_user.videos.build (video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("created_at", "updated_at", "user_id", "title", "description") VALUES (?, ?, ?, ?, ?)  [["created_at", 2017-04-28 00:05:38 UTC], ["updated_at", 2017-04-28 00:05:38 UTC], ["user_id", 4], ["title", "kmlkm"], ["description", "lkmlkmlkm"]]